---
title: GenericForm
classe: Autodesk.Revit.DB.GenericForm
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.CombinableElement
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# GenericForm

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsSolid { get; }` | `genericForm.IsSolid` | Boolean |
| `String Name { get; set; }` | `genericForm.Name` | String |
| `Category Subcategory { get; set; }` | `genericForm.Subcategory` | Category |
| `Boolean Visible { get; }` | `genericForm.Visible` | Boolean |
| `FamilyElementVisibility GetVisibility()` | `genericForm.GetVisibility()` | FamilyElementVisibility |
| `Void SetVisibility(FamilyElementVisibility)` | `genericForm.SetVisibility(visibility)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```